#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/github-actions-example/github-actions-demo/runs/run-ivLC7BnqvWaq8hqx

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=eternal-mollusk]
aws_security_group.web-sg: Refreshing state... [id=sg-01b2efbfb85769d3d]
aws_instance.web: Refreshing state... [id=i-07456a06fd883d492]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.web must be replaced
-/+ resource "aws_instance" "web" {
      ~ arn                          = "arn:aws:ec2:us-east-1:834635717119:instance/i-07456a06fd883d492" -> (known after apply)
      ~ associate_public_ip_address  = true -> (known after apply)
      ~ availability_zone            = "us-east-1c" -> (known after apply)
      ~ cpu_core_count               = 1 -> (known after apply)
      ~ cpu_threads_per_core         = 1 -> (known after apply)
      - disable_api_termination      = false -> null
      - ebs_optimized                = false -> null
      - hibernation                  = false -> null
      + host_id                      = (known after apply)
      ~ id                           = "i-07456a06fd883d492" -> (known after apply)
      ~ instance_state               = "running" -> (known after apply)
      ~ ipv6_address_count           = 0 -> (known after apply)
      ~ ipv6_addresses               = [] -> (known after apply)
      + key_name                     = (known after apply)
      - monitoring                   = false -> null
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      ~ primary_network_interface_id = "eni-057e0cfa61aa151a3" -> (known after apply)
      ~ private_dns                  = "ip-172-31-89-68.ec2.internal" -> (known after apply)
      ~ private_ip                   = "172.31.89.68" -> (known after apply)
      ~ public_dns                   = "ec2-107-22-101-41.compute-1.amazonaws.com" -> (known after apply)
      ~ public_ip                    = "107.22.101.41" -> (known after apply)
      ~ secondary_private_ips        = [] -> (known after apply)
      ~ security_groups              = [
          - "eternal-mollusk-sg",
        ] -> (known after apply)
      ~ subnet_id                    = "subnet-0a571637765a093e5" -> (known after apply)
      - tags                         = {} -> null
      ~ tenancy                      = "default" -> (known after apply)
      ~ user_data                    = "c765373c563b260626d113c4a56a46e8a8c5ca33" -> "a4468ee4a71ef1aa4f338b38c3fbf3ce32cda150" # forces replacement
        # (5 unchanged attributes hidden)

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-06923579b205c8509" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-107-22-101-41.compute-1.amazonaws.com:8080" -> (known after apply)

```
</details>
*Pusher: @timo-laasonen, Action: `pull_request`*